{"pages":[{"title":"About","text":"Who is freedom samurai?Hi, my name is Adam Faryna. I’m just regular guy, originaly from Poland, who is I passionate about online marketing and living life as a digital nomad. Over the years, I have been doing many different ventures, from working from startups, doing freelancing, teaching web development, doing affiliate marketing, running e-commerce business, to building mobile apps, and starting web development agency. On this website, I will share my experiences and my way of becoming a digital nomad and living life to the fullest. I will share valuable content, that hopely will help you to live the life on your terms as well.","link":"/about/index.html"}],"posts":[{"title":"This is How I'm Reaching my Long Term Goals When Stucked on Daily Routines","text":"No matter what our goals are we all need time to make them happen. But every day we have to deal with some time-wasting activities or far from optimal processes (and people) that will waste all our time and energy if we are not ready to handle them.Here are some basic time management strategies that I use to get the most of the day and reach my goals as planned.If your 2019 is loaded with goals as my you can find it useful.Waiting in the queueWhen waiting in a queue in the grocery, fashion store, doctor etc. I used to do the same things what other people around, nothing.The solution was getting all the books, articles, messages to be available to read from my smartphone, so even if the queue is moving slowly I waste no time.For me to stay in the queue is not problem any more. During this couple of minutes I can read couple pages of the book I digest or go through couple of articles.If doing grocery shopping, taking your clothes to dry cleaner or similar activities, took you a lot of time, maybe you should consider delegating it.Ordering groceries online become easily available in big cities these days. They are also services like dry cleaners who will come to your home and take dirty things and bring them back fresh and clean, the same or next day.These days for being productive when stating in the queues I use these smartphone apps:Pocket (for making web articles available offline from any device)Kindle, Moon+ ReaderGmail (manage multiple gmail accounts)Wunderlist (everything that can be listed I keep here)Orgzly (make my Emacs org files available on smartphone - my knowledge base) (Yes, I’m proud Emacs user)Trello (let me manage task list from anywhere)Citymapper &amp; Google Maps (let me plan commutes)Calendar (let me add/edit/delete events)Commuting / TravellingAnother huge time waster, but there are some options to solve this issue.What I do:use apps from point 1) to go through the content I have to read, I review my notes and daily plansif online, I use apps from point 1) to communicate with rest of the team and rest of the worlduse taxi-like services to do the work from the back seat and let by driven to destination in good style - magic!listen to audiobooks, podcasts, watch tutorials/seminars about topics related to your goalsdo the work remotelydon’t commute at all, unless it’s a mustIf you have a boss and you can work remotely, build a reputation that it’s what makes you the most productive, so you should have more remote days available.Preparing mealsYou can be surprise how much time it could consume. If we don’t settle for ready-to-eat microwave food, this could cost us a lot of time as long as we don’t have system at place.Cook yourself, big portions at once that you can eat part now and put rest into freezer for following days.I do cook myself a lot, big portions but simple meals. Some meals are full of nutritions, and they are easy to prepare at the same time. You can make them in minutes and feel good after. You can get some inspiration from this simple food catalogue I created notimeforcooking.com.Another option is to delegate it, by simply not being involved in preparing meals but only consuming them. For this you can order food online from the restaurants or use meals delivery services like uber eats or deliveroo.If eating healthy, organic food is important for you, you can subscribe to service like X. They will bring organic food to your home regularly.Another option is to have someone prepare meals for you. If you have girlfriend or boyfriend you can negotiate with them if they can prepare some meals during the day and you will do something in return. If you live close to your mother or grandmother, you can ask them for help. Maybe they would be eager to cook something for you from time to time, so you save precious tens of minutes.Of course, it depends on how your relations look like, but it’s worth mention that our parents more often than not are eager to help us. If you follow this strategy, keep in mind to do something for them in return to make them feel good as well.Communicating with other peopleThis could be great time waster. Some people prefer to jump over Skype or phone call, when the issue could be resolved with single sentence message. Many people overload their communication as well, by not addressing the issue or by using 100 words when less than 10 would be sufficient. Ask me, I used to work with these kinds of people.Being simple, brief communicator is a skill, but sadly many people neglect its worth, but as long as you know that it’s important to just find out what the issue is, by using the least amounts of words, but not less, you can moderate the messaging channel and strive to the point.Couple of ideas that helped me save time, when communicating with other people:make it clear what’s the point of the call before call (prepare agenda)try to get to the merit from the flood of worlds as fast as possible, verbalise it to confirm and lead to solution propose phaseif the text message doesn’t sound important, wait before replying for 30 minutes, sometimes the issue will resolve itselfbe brief, the simpler the language and the shorter your message the better (be brief but verbose enough)unless your position demands opposite, reply to the emails no more than twice a day. Turn off instant incoming notifications.don’t get involved in pointless complain or unrelated off topics, just ignore these messagesPhysical trainingWhen working at the officeIt used to happen more and more often that gym or jogging is available not only for people working remotely. Gyms have started being opening to work offices these days so the only issue could be to find time. Speak with your colleagues, maybe attending gym classes in the middle of the day is something that is normal in your working environment. If you found opposite, speak with your manager how important healthy living is for you, and it helps keep your brain powers sharp and being more productive. If he/she is not flexible, negotiate to go to the gym during lunch break and have a lunch afterwards when working at the same time. If the conversation works well, ask if company would sponsor your gym classes. There is a chance they can provide it for you. It’s worth to try.When working remotelyIn this situation, you probably have total freedom to organise your fitness activities every single day. The only issue could be how to make it time efficient.Here are some ideas that can help you:have a weekly training plan adapted to your around work availabilitymaybe you can cut off some commuting time, by buying weights and training at home at least some parts of bodySummaryThat’s it. There are many tools and strategies that we can adapt to make big savings in our time spend. There are always opportunities for improvements in the way we manage our time, so the best strategy from my experience is to always look for better ways to do things.It’s important to remember that if we stop being interested in this, the time wasters will start ruling, they always lurk around.Every garden must be tended or the weeds will take it over. (paraphrasing my mentor Jim Rohn)What’s yours time saver advices? Share them in comments.","link":"/How-I-reaching-my-long-term-goals-when-stucked-on-daily-routines/"},{"title":"Why You Shouldn't Invite Your Friend or Relative to Startup","text":"In this post I share a bit of my startups stories and experiences with partners. Sometimes it was ridiculously funny, sometimes it was painful.As you probably know, in startups world, there are no easy tasks. Everything is hard, you do everything first time, everything is new.Finding startup founder is not easy task.If you are looking for a founder or have a good friend you want to invite to you business, you may find some nuggets in my experiences shared in this post.When as a startup founder I started looking for co-founders, employees or other business partners, I soon realise why “finding right people” and convince to work with us or for us is so hard task. I believe being attractive as startup founder is a wisdom in action. It’s a lifestyle, which tells valuable people that we earn the right to be listened and give us a try. People like Steve Jobs had mastered this skill. This is one of the reasons, why as a startup or other kind of business founders we cannot be impressed enough with his results.Looking for co-founders among friends is not the best idea. Unless you have many friends and some of them have valuable skills and right attitude towards business, you probably delude ourself that our best fishing, soccer, darts or hiking buddy will be your perfect startup founder.But don’t get me wrong, it’s still possible they can be great co-founder, if they can put something on the table, don’t neglect them without second look.If you want verify if he can be good material, rather than just inviting him to the startup right on the spot, try to do some project on the side with him and let see how it will go. Of course, when you have a great startup idea and you want to make it happen as soon as possible it sounds daunting to spend time on doing things that sounds irrelevant, but In practice it can save you a lot of time, frustrations, potentially save your friendship and family relationships (if you think about bringing your family member to the business), if you could avoid situation when you have to part ways with him or her.One day, my and my brother friend share with us business idea and invited us to do it together. The plan was simple, let’s build an app and website for people with allergies for gluten to help them easily find restaurants and grocery shops when they can buy safe meals, especially when they are visiting new cities. It was great idea. Our friend and her friend, because of their allergies (one of them had celiac, the other one felt sick after small amount of gluten) were great partners candidates, they already know the domain and typical problems of our users. So we become startup of four, 2 technical geeks responsible for tech and strategic planning and 2 domain experts responsible for marketing, building community and setting partnerships.We decided that, me and my brother will build app and website, when the girls will do research, ‘infiltrate’ and build relationships in related online and offline communities.I want to emphasize here that me, my brother and our female friend, were really good friends back than. We were spending weekends together, parting, hiking through the mountains, having shared friends and so on. But when me and my brother realised the girls were only piggybacking, they don’t really know the domain and don’t provide the value they promise, we decided to “gently” part ways, but there was a problem.The idea wasn’t ours and the girls felt deceived. We tried to logically explain the situation, that to make this project successful it requires hard work from everyone, and we all have to do whatever it takes, and they are very behind, which their skills and engagement. The mentality “the idea is gold itself” was to strong for them, though.Our friendship falls apart, and we don’t speak which each other to this day. Lesson learned, hard way.Eventually the girls were overboard, so me and my brother decided to continue building app and doing business. We both have technical skills and I spend years learning about marketing and startups, so it should be a home run.We bought beautiful new flip chart, and we spend next week planning our business venture from scratch.The blueprint and the plan looks great, but when we started implementing something weird started to happen.To give you a context, me and my brother have grown up together. As kids, we used to share first computer among other things - back than we were only playing games. But almost every venture that we started together used to fall apart. It’s not because of lack of any skills, but our egos. It was just too hard for us to make decisions about things and share work. Somehow the bad emotions from the past always start to arise and even small discussion was quickly turned into battle, and to war eventually. When we tried to keep it going after two intense argues, we eventually decided to quit working together, because as we concluded “it’s somehow impossible for us to work together”.Of course after we quit our partnership our sibling relationship was recovered, but we probably will never try again, just to keep our relationship in good shape.On paper everything looks great, everyone who heard we finally started working on app together was optimistic about the outcomes. But we just not meant to build business together, and we have to just move on.There are many other stories that I want to share - especially the one I had recently - but this post is already long enough so let’s keep it for another post.Do you have any good or bad experiences doing ventures with your friends or family members? Share them in comments.","link":"/why-you-shouldnt-invite-your-friend-or-relative-to-startup/"}],"tags":[{"name":"Startups","slug":"startups","link":"/tags/startups/"},{"name":"Productivity","slug":"productivity","link":"/tags/productivity/"}],"categories":[]}